app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
    def auto_login
        user = User.find_by(id: request.headers["Authorization"])