app/controllers/chargetags_controller.rb

    def index
        chargetags = Chargetag.all
---
SELECT "chargetags".* FROM "chargetags"

    def create
        puts params
        # chargetag = Chargetag.new(charge_id: params[:charge_id], tag_id: params[:tag_id], tagtype: params[:tagtype])
        chargetag = Chargetag.new(chargetag_params)
        puts chargetag_params
        puts chargetag
            if chargetag.save
---
INSERT INTO "chargetags" ("sentcharge_id", "tag_id", "created_at", "updated_at", "tagtype") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sentcharge_id", 87], ["tag_id", 0], ["created_at", "2020-04-10 21:22:52.626833"], ["updated_at", "2020-04-10 21:22:52.626833"], ["tagtype", "Family"]]