app/controllers/charges_controller.rb

SELECT "charges".* FROM "charges"
---
    def index
        charges = Charge.all

INSERT INTO "charges" ("message", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["message", "try this again"], ["created_at", "2020-04-06 15:01:27.078704"], ["updated_at", "2020-04-06 15:01:27.078704"]]
---
    def score
        charge = Charge.new(score_params)
        score = charge.getScore(score_params)
        if charge.save