app/controllers/sentcharges_controller.rb

SELECT "sentcharges".* FROM "sentcharges"
---
    def index
        sentcharges = Sentcharge.all

INSERT INTO "sentcharges" ("user_id", "charge_id", "sent_user_id", "sentiment_score", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["charge_id", 84], ["sent_user_id", 2], ["sentiment_score", 0], ["likes", 0], ["created_at", "2020-04-06 20:39:20.548928"], ["updated_at", "2020-04-06 20:39:20.548928"]]
---
    def create
        sentcharge = Sentcharge.new(sentcharge_params)

            if sentcharge.save

SELECT "sentcharges".* FROM "sentcharges" WHERE "sentcharges"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "charges".* FROM "charges" WHERE "charges"."id" = $1 LIMIT $2  [["id", 80], ["LIMIT", 1]]
UPDATE "sentcharges" SET "likes" = $1, "updated_at" = $2 WHERE "sentcharges"."id" = $3  [["likes", 1], ["updated_at", "2020-04-06 23:08:38.894104"], ["id", 1]]
---
    def update
        puts params
        if params[:likes]
            sentcharge = Sentcharge.find(params[:id])
            sentcharge.update({likes: params[:likes]})