app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sdfas"], ["email", "sadfasdf"], ["username", "adfasdf"], ["created_at", "2020-04-08 14:49:35.648413"], ["updated_at", "2020-04-08 14:49:35.648413"]]
---
    def create
        puts params
        user = User.new(name: params[:name], email: params[:email], username: params[:username], password: params[:password])

            if user.save